app/controllers/api/v1/articles_controller.rb

  def show
    begin
      if @article.present?
        @article.update(view_count: ((@article.view_count || 0) + 1)) unless (params[:screen] == 'edit') || (@article.user == current_user)
---
UPDATE "articles" SET "view_count" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["view_count", 280], ["updated_at", "2021-10-20 23:40:59.778967"], ["id", 33]]

  def create
    begin
      article = current_user.articles.build(article_params)
      if article.valid?
        if article.save
---
INSERT INTO "articles" ("user_id", "title", "is_publish", "publish_date", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    begin
      if @article.present?
        if @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]

    def set_article
      @article = Article.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]